In [2]:
import pandas as pd

In [3]:
#Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [4]:
l=[4,8,15,16,23,42]

In [5]:
pd.Series(list(l))

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [6]:
#Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [7]:
l=[1,2,3,4,5,6,7,8,9,10]

In [8]:
s1=pd.Series(list(l))

In [9]:
s1

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [10]:
s1[1]

2

In [11]:
s1[9]

10

In [12]:
pd.DataFrame(data=[["name","Age","Gender"],
             ["Alice",25,"Female"],
             ["BOB",30,"Male"],
              ["claire",27,"Female"],
            ])

        0    1       2
0    name  Age  Gender
1   Alice   25  Female
2     BOB   30    Male
3  claire   27  Female

In [13]:
#Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In [14]:
df=pd.DataFrame(data={"a":[1,2,3,4],
            "b":[4,5,6,9],
            "c":[7,8,9,10]})

In [15]:
df

   a  b   c
0  1  4   7
1  2  5   8
2  3  6   9
3  4  9  10

In [16]:
type(df)

pandas.core.frame.DataFrame

In [17]:
df[["a"]]

   a
0  1
1  2
2  3
3  4

In [18]:
type(df["a"])

pandas.core.series.Series

In [19]:
#Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

In [20]:
df1=pd.read_csv("data.csv")

In [21]:
df1

     subject  number grade
0      maths     204     A
1    english     542     B
2    science     657     C
3     polity     541     A
4    history     856     B
5  geography     896     A
6  economics     567     b

In [22]:
df.head()

   a  b   c
0  1  4   7
1  2  5   8
2  3  6   9
3  4  9  10

In [23]:
df.tail()

   a  b   c
0  1  4   7
1  2  5   8
2  3  6   9
3  4  9  10

In [24]:
df1.columns

Index(['subject', 'number', 'grade'], dtype='object')

In [25]:
df1.drop("subject",axis=1,inplace=True)

In [26]:
df1

   number grade
0     204     A
1     542     B
2     657     C
3     541     A
4     856     B
5     896     A
6     567     b

In [27]:
df1.drop(1,axis=0,inplace=False)

   number grade
0     204     A
2     657     C
3     541     A
4     856     B
5     896     A
6     567     b

In [28]:
#Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

In [53]:
#dataframe is mutable and series is also mutable but we will change their contents and pannel is deprecated

In [38]:
df3=pd.read_csv("data.csv")

In [39]:
df3

     subject  number grade
0      maths     204     A
1    english     542     B
2    science     657     C
3     polity     541     A
4    history     856     B
5  geography     896     A
6  economics     567     b

In [40]:
df3.set_index("number")

          subject grade
number
204         maths     A
542       english     B
657       science     C
541        polity     A
856       history     B
896     geography     A
567     economics     b

In [45]:
data2={"value":[1,2,3,4,5,6]}
df5=pd.DataFrame(data2)

In [46]:
df5

   value
0      1
1      2
2      3
3      4
4      5
5      6

In [51]:
df5['flag']=df5["value"]==6

In [52]:
df5

   value   flag
0      1  False
1      2  False
2      3  False
3      4  False
4      5  False
5      6   True

In [30]:
#Q7. Create a DataFrame using multiple Series. Explain with an example.

In [31]:
data1={"key1":[1,2,3,4],
                   "key2":["raj","chiku","harsh","mau"],
                   "key3":[5,3,6,7]}

In [32]:
df2=pd.DataFrame(data1)

In [33]:
df2

   key1   key2  key3
0     1    raj     5
1     2  chiku     3
2     3  harsh     6
3     4    mau     7

In [34]:
df2[["key1","key2"]]

   key1   key2
0     1    raj
1     2  chiku
2     3  harsh
3     4    mau